Outline/Research-Outline.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Research Outline</title>
<meta name="author" content="(Ryan Greenup & James Guerra)"/>
<link rel="stylesheet" href="./reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="./reveal.js/dist/theme/moon.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
<link rel="stylesheet" type="text/css" href="style.css">

</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Research Outline</h1><h2 class="author">Ryan Greenup &amp; James Guerra</h2><p class="date">Created: 2020-08-12 Wed 16:47</p>
</section>
<section id="table-of-contents"><div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#/slide-org171c296">1. Give a brief Sketch of the project</a>
<ul>
<li><a href="#/slide-orgc180ec5">1.1. Topic / Context</a></li>
<li><a href="#/slide-orgc9f1c92">1.2. Motivation</a></li>
<li><a href="#/slide-org0987885">1.3. Basic Ideas</a></li>
<li><a href="#/slide-orgc483d2b">1.4. Where are the Mathematics</a></li>
<li><a href="#/slide-orge610292">1.5. Don&rsquo;t Forget we need a talk</a>
<ul>
<li><a href="#/slide-org667ece6">1.5.1. Slides In Org Mode</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#/slide-org2b35f13">2. What we&rsquo;re looking for</a></li>
<li><a href="#/slide-org33a9d4a">3. Download RevealJS</a></li>
</ul>
</div>
</div>
</section>
<div class="org-src-container">

<pre  class="src src-bash"><code trim>code /home/ryan/Dropbox/Studies/QuantProject/Current/Python-Quant/ &amp; <span style="color: #c678dd;">disown</span>
</code></pre>
</div>

<p>
Here&rsquo;s what I gatthered from the week 3 slides
</p>

<section>
<section id="slide-org171c296">
<h2 id="org171c296"><span class="section-number-2">1</span> Give a brief Sketch of the project</h2>
<div class="outline-text-2" id="text-1">
</div>
</section>
<section id="slide-orgc180ec5">
<h3 id="orgc180ec5"><span class="section-number-3">1.1</span> Topic / Context</h3>

</section>
<section id="slide-orgc9f1c92">
<h3 id="orgc9f1c92"><span class="section-number-3">1.2</span> Motivation</h3>

</section>
<section id="slide-org0987885">
<h3 id="org0987885"><span class="section-number-3">1.3</span> Basic Ideas</h3>
<ul>
<li>Look at FOSS CAS Systems
<ul>
<li>Python (Sympy)</li>
<li>Julia
<ul>
<li>Sympy integration</li>
<li>symEngine</li>
<li>Reduce.jl</li>
<li>Symata.jl</li>

</ul></li>

</ul></li>

<li>Maybe look at interactive sessions:
<ul>
<li>Like Jupyter</li>
<li>Hydrogen</li>
<li>TeXmacs</li>
<li>org-mode?</li>

</ul></li>

</ul>

<p>
After getting an overview of SymPy let&rsquo;s look at problems that are interesting (chaos, morphogenesis and order from disarray etc.)
</p>


</section>
<section id="slide-orgc483d2b">
<h3 id="orgc483d2b"><span class="section-number-3">1.4</span> Where are the Mathematics</h3>
<ul>
<li>Trying to look at the algorithms underlying functions in Python/Sympy and other Computer algebra tools such as Maxima, Maple, Mathematica, Sage, GAP and Xcas/Giac, Yacas, Symata.jl, Reduce.jl, SymEngine.jl
<ul>
<li>For Example Recursive Relations</li>

</ul></li>
<li>Look at solving some problems related to chaos theory maybe
<ul>
<li>Mandelbrot and Julia Sets</li>

</ul></li>
<li>Look at solving some problems related to Fourier Transforms maybe</li>

</ul>


<p>
AVOID DETAILS, JUST SKETCH THE PROJECT OUT.
</p>


</section>
<section id="slide-orge610292">
<h3 id="orge610292"><span class="section-number-3">1.5</span> Don&rsquo;t Forget we need a talk</h3>
<div class="outline-text-3" id="text-1-5">
</div>
</section>
<section id="slide-org667ece6">
<h4 id="org667ece6"><span class="section-number-4">1.5.1</span> Slides In Org Mode</h4>
<ul>
<li><a href="https://orgmode.org/worg/org-tutorials/non-beamer-presentations.html">Without Beamer</a></li>
<li><a href="https://orgmode.org/worg/exporters/beamer/tutorial.html">With Beamer</a></li>

</ul>

</section>
</section>
<section>
<section id="slide-org2b35f13">
<h2 id="org2b35f13"><span class="section-number-2">2</span> What we&rsquo;re looking for</h2>
<ul>
<li>Would a reader know what the project is about?</li>
<li>Would a reader become interested in the upcoming report?</li>
<li>Is it brief but well prepared?</li>
<li>Are the major parts or phases sketched out</li>

</ul>



</section>
</section>
<section>
<section id="slide-org33a9d4a">
<h2 id="org33a9d4a"><span class="section-number-2">3</span> Download RevealJS</h2>
<p>
So first do <code>M-x package-install ox-reveal</code> then do <code>M-x load-library</code> and then look for <code>ox-reveal</code>
</p>

<p>
Download Reveal.js and put it in the directory as <code>./reveal.js</code>, you can do that with something like this:
</p>

<div class="org-src-container">

<pre  class="src src-bash"><code trim><span style="color: #5B6268;"># </span><span style="color: #5B6268;">cd</span><span style="color: #5B6268;"> /home/ryan/Dropbox/Studies/2020Spring/QuantProject/Current/Python-Quant/Outline/</span>
wget https://github.com/hakimel/reveal.js/archive/master.tar.gz
tar -xzvf master.tar.gz &amp;&amp; <span style="color: #ECBE7B;">rm</span> master.tar.gz
<span style="color: #ECBE7B;">mv</span> reveal.js-master reveal.js
</code></pre>
</div>

<p>
Then just do <code>C-c e e R R</code> to export with RevealJS as opposed to PHP you won&rsquo;t need a fancy server, just open it in the browser.
</p>
</section>
</section>
</div>
</div>
<script src="./reveal.js/dist/reveal.js"></script>
<script src="./reveal.js/plugin/markdown/markdown.js"></script>
<script src="./reveal.js/plugin/zoom/zoom.js"></script>
<script src="./reveal.js/plugin/notes/notes.js"></script>


<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({
plugins: [RevealMarkdown,RevealZoom,RevealNotes],
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
]
});
</script>
</body>
</html>
